In [1]:
import pandas as pd 
import numpy as np 
from sklearn.impute import SimpleImputer

In [12]:
dataframe = pd.DataFrame({
"Nome": ['Iuru', 'Yoru', 'Sage'],
"Nota_1": [np.nan, 10, 8],
"Nota_2": [1, 2, np.nan],
"Turma": ["01", "02", np.nan],
"Idade": [20, np.nan, 21],
"Peso": [68, 90, np.nan]
})

dataframe

   Nome  Nota_1  Nota_2 Turma  Idade  Peso
0  Iuru     NaN     1.0    01   20.0  68.0
1  Yoru    10.0     2.0    02    NaN  90.0
2  Sage     8.0     NaN   NaN   21.0   NaN

In [13]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nome    3 non-null      object
 1   Nota_1  2 non-null      float64
 2   Nota_2  2 non-null      float64
 3   Turma   2 non-null      object
 4   Idade   2 non-null      float64
 5   Peso    2 non-null      float64
dtypes: float64(4), object(2)
memory usage: 272.0+ bytes

In [14]:
dataframe.shape

(3, 6)

In [15]:
dataframe.isnull()

    Nome  Nota_1  Nota_2  Turma  Idade   Peso
0  False    True   False  False  False  False
1  False   False   False  False   True  False
2  False   False    True   True  False   True

In [16]:
dataframe.isnull().sum()

Nome      0
Nota_1    1
Nota_2    1
Turma     1
Idade     1
Peso      1
dtype: int64

In [17]:
dataframe_clean = dataframe.dropna(inplace=False, axis=0)

dataframe_clean

Empty DataFrame
Columns: [Nome, Nota_1, Nota_2, Turma, Idade, Peso]
Index: []

In [18]:
frequentes = SimpleImputer(missing_values=np.nan, strategy='most_frequent')

media = SimpleImputer(missing_values=np.nan, strategy='mean')

mediana = SimpleImputer(missing_values=np.nan, strategy='median')

constantes = SimpleImputer(missing_values=np.nan, strategy='constant', fill_value=0)

In [23]:
dataframe.Nota_1 = constantes.fit_transform(dataframe[['Nota_1']])
dataframe.Nota_2 = constantes.fit_transform(dataframe[['Nota_2']])
dataframe.Turma = frequentes.fit_transform(dataframe[['Turma']])
dataframe.Idade = mediana.fit_transform(dataframe[['Idade']])
dataframe.Peso = media.fit_transform(dataframe[['Peso']])

dataframe

   Nome  Nota_1  Nota_2 Turma  Idade  Peso
0  Iuru     0.0     1.0    01   20.0  68.0
1  Yoru    10.0     2.0    02   20.5  90.0
2  Sage     8.0     0.0    01   21.0  79.0